"""
*******************************************************************
***  File Name      : Data.py
***  Version        : V1.1
***  Designer       : 太田峻輔
***  Date           : 2022.6.14
***  Purpose       	: 構造体クラスのData型のクラス定義
*******************************************************************/
"""

"""
*******************************************************************
***  Class Name     : Data
***  Version        : V1.1
***  Designer       : 太田峻輔
***  Date           : 2022.6.14
***  Purpose       	: 構造体クラスのData型のクラス定義
*******************************************************************/
"""

class Data:
    def __init__(self):
        self.ListInstantSpeed = []
        self.MaxSpeed = 0
        self.WiFiName = ''
        self.color = ''